{"intents": [
  {"tag": "greeting",
    "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day"],
    "responses": ["Hello, thanks for visiting", "Good to see you again", "Hi there, how can I help?"],
    "context_set": ""
  },
  {"tag": "goodbye",
    "patterns": ["Bye", "See you later", "Goodbye"],
    "responses": ["See you later, thanks for visiting", "Have a nice day", "Bye! Come back again soon."]
  },
  {"tag": "Machine's electric function",
    "patterns": ["machine's electric function"],
    "responses": ["1) Circuit Breakers are used as machine's overload and circuit short protect. 2) Soft limit and mechanic limit has been set on the machine."]
  },
  {"tag": "Everyday Maintenance",
    "patterns": ["Everyday Maintenance"],
    "responses": ["As we required in Permeable, only electrician is allowed to do repair and maintain job for this machine. And the machine should meet with requirements below: 1) Check electronic oil pump to see that if lubrication oil is needed. 2) Check Oily water separator to see if the oil is enough or not. (If the oil falls below the indication, more oil is needed). 3) Check that if spindle huff is normal or not. 4) Clean the spindle with soft cloth, and lubricate it with 68# oil. 5) Clean every parts of ATC clearly. 6) Clean every blade tool. 7) Clean all the blocks and limit switch on the machine. 8)Drain hydrosphere in the oily water separator. 9) Keep the working area clean. 10) Clean every dust-anti window every day. 11) Check circuit breaker, contactor, relay, servo drive module etc. check if electric wire is loosened or not. 12) Grounded system must be closely and constantly. 13) Make sure that fan and spindle heat exchanger works well, or else it will cause damage to the electric components"]
  },
  {"tag": "Every week Maintenance",
    "patterns": ["Every week Maintenance"],
    "responses": ["1) Clean the filter net of oil water separator and heat exchanger. 2) Clean the tool cover of Auto Tool Changer. 3) Check and clean limit switch. 4) Check if all warning labels are clear or not."]
  },
  {"tag": "3M Maintenance",
    "patterns": ["Check every three months Maintenance", "3 months"],
    "responses": ["1) Clean or refresh the lubrication oil and oil-suck filter net. 2) Check parameters of every axis."]
  },
  {"tag": "6M Maintenance",
    "patterns": ["Check every six months Maintenance", "6 months"],
    "responses": ["1) Clean or refresh the lubrication oil and oil-suck filter net. 2) Check parameters and origin of every axis. 3) Check that if every scrape is wearable or not. 4) Check if every servo motor and spindle runs in normal, if so contact manufacturer immediately. 5) Check lubrication and 6) Check and adjust the leveling of the machine."]
  },
  {"tag": "every year Maintenance",
    "patterns": ["Check every year Maintenance", "Yearly", "annually"],
    "responses": ["1) Check the verticality of every axis, and adjust it. 2) Check if lubrication oil pipe is good or not. Warning: 1. Only professional operators are allowed to repair the Auto Tool Changer. 2. Others should be far away from working area."]
  }
]
}